Revit 2024 API
BuiltInFailures.AutoJoinFailures.UnexpectedJoinFailure Property
 Join failure caused by editability or design option related problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnexpectedJoinFailure { get; }
Visual Basic
Public Shared ReadOnly Property UnexpectedJoinFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnexpectedJoinFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace